In [354]:
import pandas as pd
sales = pd.read_csv('sales_600k.csv', encoding = 'utf-8')
group_sales = pd.read_csv('group_sales.csv', encoding = 'utf-8')
customers = pd.read_csv('customers_us.csv', encoding = 'utf-8')
employees = pd.read_csv('employees.csv', encoding = 'utf-8')
products = pd.read_csv('products.csv', encoding = 'utf-8')
stores = pd.read_csv('stores.csv', encoding = 'utf-8')

In [355]:
# sales
sales.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600000 entries, 0 to 599999
Data columns (total 18 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Invoice ID       600000 non-null  object
 1   Line             600000 non-null  int64
 2   Customer ID      600000 non-null  int64
 3   Product ID       600000 non-null  int64
 4   Size             558427 non-null  object
 5   Color            185103 non-null  object
 6   Unit Price       600000 non-null  float64
 7   Quantity         600000 non-null  int64
 8   Date             600000 non-null  object
 9   Discount         600000 non-null  float64
 10  Line Total       600000 non-null  float64
 11  Store ID         600000 non-null  int64
 12  Employee ID      600000 non-null  int64
 13  Currency         600000 non-null  object
 14  Currency Symbol  600000 non-null  object
 15  SKU              600000 non-null  object
 16  Payment Method   600000 non-null  object
 17  Invoice Total    600000 non-null  float64
dtypes: float64(4), int64(6), object(8)
memory usage: 300.9 MB

In [356]:
# drop unuseful columns
cols = ['Line','Size', 'Color', 'Currency', 'Currency Symbol', 'SKU', 'Payment Method']
sales = sales.drop(cols, axis = 1)

In [357]:
# detect null values
sales.isna().sum()

Invoice ID       0
Customer ID      0
Product ID       0
Unit Price       0
Quantity         0
Date             0
Discount         0
Line Total       0
Store ID         0
Employee ID      0
Invoice Total    0
dtype: int64

In [358]:
sales.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600000 entries, 0 to 599999
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Invoice ID     600000 non-null  object
 1   Customer ID    600000 non-null  int64
 2   Product ID     600000 non-null  int64
 3   Unit Price     600000 non-null  float64
 4   Quantity       600000 non-null  int64
 5   Date           600000 non-null  object
 6   Discount       600000 non-null  float64
 7   Line Total     600000 non-null  float64
 8   Store ID       600000 non-null  int64
 9   Employee ID    600000 non-null  int64
 10  Invoice Total  600000 non-null  float64
dtypes: float64(4), int64(5), object(2)
memory usage: 119.0 MB

In [359]:
sales.describe()

,Customer ID,Product ID,Unit Price,Quantity,Discount,Line Total,Store ID,Employee ID,Invoice Total
count,6.000000e+05,600000.000000,600000.000000,600000.000000,600000.000000,600000.000000,600000.000000,600000.000000,600000.000000
mean,7.275523e+04,7725.361995,49.224652,1.100320,0.172595,45.556516,1.273020,6.046338,97.237490
std,9.051764e+04,4158.624914,26.499526,0.396597,0.208393,34.949987,0.445511,3.753199,99.316802
min,1.000000e+00,1.000000,4.000000,1.000000,0.000000,2.200000,1.000000,2.000000,2.200000
25%,2.421900e+04,4422.000000,30.000000,1.000000,0.000000,23.100000,1.000000,3.000000,32.400000
50%,4.856800e+04,7315.000000,42.500000,1.000000,0.000000,36.900000,1.000000,5.000000,59.500000
75%,9.818500e+04,11831.000000,62.000000,1.000000,0.400000,56.500000,2.000000,8.000000,124.922500
max,1.643187e+06,14950.000000,150.500000,3.000000,0.600000,450.000000,2.000000,15.000000,1050.500000

In [360]:
# convert columns to appropriate datatype
sales = sales.astype({'Quantity':'Int8', 'Store ID':'Int8', 'Employee ID':'Int8', 'Date':'datetime64[ns]'})
sales.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600000 entries, 0 to 599999
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Invoice ID     600000 non-null  object
 1   Customer ID    600000 non-null  int64
 2   Product ID     600000 non-null  int64
 3   Unit Price     600000 non-null  float64
 4   Quantity       600000 non-null  Int8
 5   Date           600000 non-null  datetime64[ns]
 6   Discount       600000 non-null  float64
 7   Line Total     600000 non-null  float64
 8   Store ID       600000 non-null  Int8
 9   Employee ID    600000 non-null  Int8
 10  Invoice Total  600000 non-null  float64
dtypes: Int8(3), datetime64[ns](1), float64(4), int64(2), object(1)
memory usage: 74.4 MB

In [361]:
sales.to_csv('sales_c.csv', encoding = 'utf-8', index = False)

In [362]:
# group_sales 
group_sales.head()

,Invoice ID,Customer ID,Date,Quantity,Store ID,Employee ID,Invoice Total
0,INV-US-001-04128642,268,2023-01-01 20:23:00,7,1,5,1014.3
1,INV-US-001-04128643,45500,2023-01-01 18:30:00,1,1,2,20.7
2,INV-US-001-04128644,26865,2023-01-01 08:46:00,1,1,6,20.7
3,INV-US-001-04128645,35878,2023-01-01 18:43:00,6,1,2,855.0
4,INV-US-001-04128646,7845,2023-01-01 16:46:00,1,1,3,13.5

In [363]:
# detect null value
group_sales.isna().sum()

Invoice ID       0
Customer ID      0
Date             0
Quantity         0
Store ID         0
Employee ID      0
Invoice Total    0
dtype: int64

In [364]:
group_sales.describe()

,Customer ID,Quantity,Store ID,Employee ID,Invoice Total
count,4.288390e+05,428839.000000,428839.000000,428839.000000,428839.000000
mean,7.291444e+04,1.539487,1.273632,6.052078,136.047547
std,9.149678e+04,1.212454,0.445823,3.753049,332.341089
min,1.000000e+00,1.000000,1.000000,2.000000,2.200000
25%,2.425100e+04,1.000000,1.000000,3.000000,26.100000
50%,4.865000e+04,1.000000,1.000000,5.000000,44.500000
75%,9.824900e+04,2.000000,2.000000,8.000000,94.500000
max,1.643187e+06,14.000000,2.000000,15.000000,7353.500000

In [365]:
group_sales.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428839 entries, 0 to 428838
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Invoice ID     428839 non-null  object
 1   Customer ID    428839 non-null  int64
 2   Date           428839 non-null  object
 3   Quantity       428839 non-null  int64
 4   Store ID       428839 non-null  int64
 5   Employee ID    428839 non-null  int64
 6   Invoice Total  428839 non-null  float64
dtypes: float64(1), int64(4), object(2)
memory usage: 72.0 MB

In [366]:
# convert columns to appropriate data type
group_sales = group_sales.astype({'Quantity':'Int8', 'Store ID':'Int8', 'Employee ID':'Int8', 'Date':'datetime64[ns]'})
group_sales.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428839 entries, 0 to 428838
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Invoice ID     428839 non-null  object
 1   Customer ID    428839 non-null  int64
 2   Date           428839 non-null  datetime64[ns]
 3   Quantity       428839 non-null  Int8
 4   Store ID       428839 non-null  Int8
 5   Employee ID    428839 non-null  Int8
 6   Invoice Total  428839 non-null  float64
dtypes: Int8(3), datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 40.1 MB

In [367]:
group_sales.to_csv('group_sales_c.csv', encoding = 'utf-8', index = False)

In [368]:
# customers
customers.head()

   Customer ID            Name        Country Gender Date Of Birth
0            1     Danny Hardy  United States      M    1983-07-09
1            2      Billy Cook  United States      M    1997-09-21
2            3  Monica Jackson  United States      F    1992-10-13
3            4   Sarah Carroll  United States      F    1979-07-08
4            5    Dana Gardner  United States      F    1970-07-11

In [369]:
customers = customers.drop('Country', axis = 1)
customers.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 354450 entries, 0 to 354449
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Customer ID    354450 non-null  int64
 1   Name           354450 non-null  object
 2   Gender         354450 non-null  object
 3   Date Of Birth  354450 non-null  object
dtypes: int64(1), object(3)
memory usage: 60.6 MB

In [370]:
# detect null value
customers.isna().sum()

Customer ID      0
Name             0
Gender           0
Date Of Birth    0
dtype: int64

In [371]:
customers.describe()

         Customer ID
count  354450.000000
mean   177225.500000
std    102321.045795
min         1.000000
25%     88613.250000
50%    177225.500000
75%    265837.750000
max    354450.000000

In [372]:
# convert columns to appropriate data type
customers = customers.astype({'Customer ID':'Int32', 'Gender':'category', 'Date Of Birth':'datetime64[ns]'})
customers.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 354450 entries, 0 to 354449
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Customer ID    354450 non-null  Int32
 1   Name           354450 non-null  object
 2   Gender         354450 non-null  category
 3   Date Of Birth  354450 non-null  datetime64[ns]
dtypes: Int32(1), category(1), datetime64[ns](1), object(1)
memory usage: 25.8 MB

In [373]:
customers.to_csv('customers_c.csv', encoding = 'utf-8', index = False)

In [374]:
# employees
employees.head()

   Employee ID  Store ID                Name Position
0            1         1        Jesus Jacobs  Manager
1            2         1  Gabriel Cunningham   Seller
2            3         1   Timothy Fernandez   Seller
3            4         1      Natalie Rogers   Seller
4            5         1  Elizabeth Cantrell   Seller

In [375]:
employees = employees.drop('Position', axis = 1)
employees.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  264 non-null    int64
 1   Store ID     264 non-null    int64
 2   Name         264 non-null    object
dtypes: int64(2), object(1)
memory usage: 21.9 KB

In [376]:
# detect null value
employees.isna().sum()

Employee ID    0
Store ID       0
Name           0
dtype: int64

In [377]:
employees.describe()

       Employee ID    Store ID
count   264.000000  264.000000
mean    132.500000   17.875000
std      76.354437   10.072527
min       1.000000    1.000000
25%      66.750000    9.750000
50%     132.500000   17.000000
75%     198.250000   27.000000
max     264.000000   35.000000

In [378]:
# convert column to appropriate data type
employees = employees.astype({'Employee ID':'Int16', 'Store ID':'Int8'})
employees.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  264 non-null    Int16
 1   Store ID     264 non-null    Int8
 2   Name         264 non-null    object
dtypes: Int16(1), Int8(1), object(1)
memory usage: 19.1 KB

In [379]:
employees.to_csv('employees_c.csv', encoding = 'utf-8', index = False)

In [380]:
# products
products.head()

,Product ID,Category,Sub Category,Description PT,Description DE,Description FR,Description ES,Description EN,Description ZH,Color,Sizes,Production Cost
0,1,Feminine,Coats and Blazers,Esportivo Veludo Verde Com Botões,Sport Samt Sport Mit Knöpfen,Sports Velvet Sports Avec Des Boutons,Deportes De Terciopelo Con Botones,Sports Velvet Sports With Buttons,运动天鹅绒运动与按钮,NaN,S|M|L|XL,41.68
1,2,Feminine,Sweaters and Knitwear,Luxuoso Denim Rosa Com Botões,Luxuriöser Rosa Jeans Mit Knöpfen,Léchard De Denim Rose Avec Boutons,Denim Rosa Lujoso Con Botones,Luxurious Pink Denim With Buttons,豪华的粉红色牛仔布和纽扣,PINK,S|M|L|XL,15.07
2,3,Feminine,Dresses and Jumpsuits,Retrô Tricot Preto Estampado,Black Tricot Gedruckter Tricot,Tricot Imprimé En Tricot Noir,Tricot Negro Tricot Impreso,Black Tricot Printed Tricot,黑色三角形印刷三角形,BLACK,S|M|L,19.56
3,4,Feminine,Shirts and Blouses,Blusa De Algodão Básica,Basis -Baumwollbluse,Chemisier En Coton De Base,Blusa De Algodón,Basic Cotton Blouse,基本的棉衬衫,NaN,S|M|L|XL,14.62
4,5,Feminine,T-shirts and Tops,T-Shirt Básica De Algodão,Basis-Baumwoll-T-Shirt,T-Shirt En Coton De Base,Camiseta Básica De Algodón,Basic Cotton T-Shirt,基本棉T恤,NaN,S|M|L|XL,7.80

In [381]:
# drop unuseful columns
products = products.drop(products.columns[3:11], axis = 1)
products.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14950 entries, 0 to 14949
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Product ID       14950 non-null  int64
 1   Category         14950 non-null  object
 2   Sub Category     14950 non-null  object
 3   Production Cost  14950 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.0 MB

In [382]:
products.isna().sum()

Product ID         0
Category           0
Sub Category       0
Production Cost    0
dtype: int64

In [383]:
products.describe()

         Product ID  Production Cost
count  14950.000000      14950.00000
mean    7475.500000         15.97553
std     4315.837597         11.36552
min        1.000000          0.54000
25%     3738.250000          7.84000
50%     7475.500000         13.21500
75%    11212.750000         20.72000
max    14950.000000         76.36000

In [384]:
products['Sub Category'].nunique()

21

In [385]:
# convert columns to appropriate data type
products = products.astype({'Product ID':'Int32', 'Category':'category'})
products.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14950 entries, 0 to 14949
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Product ID       14950 non-null  Int32
 1   Category         14950 non-null  category
 2   Sub Category     14950 non-null  object
 3   Production Cost  14950 non-null  float64
dtypes: Int32(1), category(1), float64(1), object(1)
memory usage: 1.1 MB

In [386]:
products.to_csv('products_c.csv', encoding = 'utf-8', index = False)

In [387]:
# stores
stores.head()

,Store ID,Country,City,Store Name,Number of Employees,ZIP Code,Latitude,Longitude
0,1,United States,New York,Store New York,6,10001,40.7128,-74.0060
1,2,United States,Los Angeles,Store Los Angeles,9,90001,34.0522,-118.2437
2,3,United States,Chicago,Store Chicago,7,60601,41.8781,-87.6298
3,4,United States,Houston,Store Houston,7,77001,29.7604,-95.3698
4,5,United States,Phoenix,Store Phoenix,5,85001,33.4484,-112.0740

In [388]:
# reload csv file to specify columns
stores = pd.read_csv('stores.csv', encoding = 'utf-8', usecols = ['Store ID', 'City', 'Number of Employees'])
stores.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Store ID             35 non-null     int64
 1   City                 35 non-null     object
 2   Number of Employees  35 non-null     int64
dtypes: int64(2), object(1)
memory usage: 2.7 KB

In [389]:
stores.isna().sum()

Store ID               0
City                   0
Number of Employees    0
dtype: int64

In [390]:
stores.describe()

        Store ID  Number of Employees
count  35.000000            35.000000
mean   18.000000             7.542857
std    10.246951             1.720856
min     1.000000             5.000000
25%     9.500000             6.000000
50%    18.000000             8.000000
75%    26.500000             9.000000
max    35.000000            10.000000

In [391]:
stores = stores.astype({'Store ID':'Int8', 'Number of Employees':'Int8'})
stores.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Store ID             35 non-null     Int8
 1   City                 35 non-null     object
 2   Number of Employees  35 non-null     Int8
dtypes: Int8(2), object(1)
memory usage: 2.3 KB

In [392]:
stores.to_csv('stores_c.csv', encoding = 'utf-8', index = False)